/*
 * @version: 2.0
 * @LastEditors: qingmeijiupiao
 * @Description: HXC CAN基类文件,需要用到CAN时应该使用此类作为传入类型，方便扩展不同的CAN方式
 * @Author: qingmeijiupiao
 * @LastEditTime: 2025-05-18 21:21:38
 */

#ifndef HXC_CAN_BASE_HPP
#define HXC_CAN_BASE_HPP
#include "HXC_std_err_def.h"
#include <map>
#include <functional>
/*↓↓↓本文件的声明↓↓↓*/

//CAN基类,需要用到CAN时应该使用此类作为传入类型，方便扩展不同的CAN方式
class HXC_CAN;

//CAN消息结构体
struct HXC_CAN_message_t;

//CAN消息接收回调函数
using HXC_can_feedback_func= std::function<void(HXC_CAN_message_t* can_message)>;

//CAN速率枚举
enum CAN_RATE{
  CAN_RATE_1MBIT,
  CAN_RATE_800KBIT,
  CAN_RATE_500KBIT,
  CAN_RATE_250KBIT,
  CAN_RATE_125KBIT,
  CAN_RATE_100KBIT
};


/*↑↑↑本文件的声明↑↑↑*/

//CAN消息结构体
struct HXC_CAN_message_t{
  bool extd=0;           /**< 扩展帧格式标志（29位ID） */
  bool rtr=0;            /**< 远程帧标志 */
  bool self=0;           /**< 自我接收请求。接收时无效。 */
  uint32_t identifier;                /**< 11或29位标识符 */
  uint8_t data_length_code;           /**< 数据长度代码 */
  uint8_t data[8];    /**< 数据字节（在RTR帧中无关） */
};

//CAN基类
class HXC_CAN {
public:
    // 防止值传递CAN对象
    HXC_CAN(const HXC_CAN&) = delete;               /**< 删除拷贝构造函数 */
    HXC_CAN& operator=(const HXC_CAN&) = delete;    /**< 删除拷贝赋值函数 */
    HXC_CAN(HXC_CAN&&) = delete;                    /**< 删除移动构造函数 */
    HXC_CAN& operator=(HXC_CAN&&) = delete;         /**< 删除移动赋值函数 */

    HXC_CAN();  /**< 默认构造函数 */
    virtual ~HXC_CAN();  /**< 析构函数 */

    /**
     * @description: 初始化
     * @return {esp_err_t} 成功返回ESP_OK
     * @Author: qingmeijiupiao
     * @param {CAN_RATE} can_rate CAN速率
     */
    virtual hxc_err_t setup(CAN_RATE can_rate);

    /**
     * @description: 发送CAN消息
     * @return {esp_err_t} 成功返回ESP_OK
     * @Author: qingmeijiupiao
     * @param {HXC_CAN_message_t*} message CAN消息指针
     */
    virtual hxc_err_t send(HXC_CAN_message_t* message);

    /**
     * @description: 发送CAN消息
     * @return {esp_err_t} 成功返回ESP_OK
     * @Author: qingmeijiupiao
     * @param {HXC_CAN_message_t} message CAN消息
     */
    virtual hxc_err_t send(HXC_CAN_message_t message);

    /**
     * @description: 添加CAN消息接收回调,收到对应地址的消息时运行回调函数
     * @return {*}
     * @Author: qingmeijiupiao
     * @param {int} addr CAN消息地址
     * @param {HXC_can_feedback_func} func 回调函数
     */
    void add_can_receive_callback_func(int addr, HXC_can_feedback_func func);

    /**
     * @description: 移除CAN消息接收回调函数
     * @return {*}
     * @Author: qingmeijiupiao
     * @param {int} addr CAN消息地址
     */
    void remove_can_receive_callback_func(int addr);

    /**
     * @description: 判断CAN消息接收回调函数是否存在
     * @return {bool} 如果回调函数存在则返回true，否则返回false
     * @Author: qingmeijiupiao
     * @param {int} addr CAN消息地址
     */
    bool exist_can_receive_callback_func(int addr);


    bool get_setup_flag();
protected:
    std::map<int, HXC_can_feedback_func> func_map;  /**< CAN回调函数映射表 */
    bool is_setup = false;  /**< CAN初始化状态标志 */
    CAN_RATE can_rate;  /**< 当前CAN速率 */
};


#endif
/*
                                              .=%@#=.                                               
                                            -*@@@@@@@#=.                                            
                                         .+%@@@@@@@@@@@@#=                                          
                                       -#@@@@@@@* =@@@@@@@@*:                                       
                                     =%@@@@@@@@=   -@@@@@@@@@#-                                     
                                  .+@@@@@@@@@@-     .@@@@@@@@@@%=                                   
                                .+@@@@@@@@@@@@-     +@@@@@@@@@@@@@+.                                
                               +@@@@@@@@@@@@@@@    .@@@@@@@@@@@@@@@@+.                              
                             =@@@@@@@@@@@@@@@%-     =%@@%@@@@@@@@@@@@@=                             
                           -%@@@@@@@@@@@@+..     .       -@@@@@@@@@@@@@%-                           
                         .#@@@@@@@@@@@@@#       -@+       +@@@@@@@@@@@@@@#:                         
                        +@@@@@@@@@@@@@@@@+     +@@@+     =@@@@@@@@@@@@@@@@@+                        
                      :%@@@@@@@@@@@@@@@@@+    *@@@@*     =@@@@@@@@@@@@@@@@@@%-                      
                     +@@@@@@@@@@@@@@#+*+-   .#@@@@+       :+*+*@@@@@@@@@@@@@@@*                     
                   :%@@@@@@@@@@@@@@+       :%@@@@-    .-       -@@@@@@@@@@@@@@@%:                   
                  =@@@@@@@@@@@@@@@@-      -@@@@%:    .%@+      =@@@@@@@@@@@@@@@@@=                  
                 *@@@@@@@@@@@@@@@@@@.    =@@@@#.    -@@@@+    =@@@@@@@@@@@@@@@@@@@#                 
               .%@@@@@@@@@@@@@@@@@@+    +@@@@*     =@@@@%:    .#@@@@@@@@@@@@@@@@@@@%.               
              :@@@@@@@@@@@@@@@%:::.    #@@@@+     +@@@@#        .::.*@@@@@@@@@@@@@@@@-              
             -@@@@@@@@@@@@@@@%       .%@@@@=     *@@@@*     +-       *@@@@@@@@@@@@@@@@=             
            =@@@@@@@@@@@@@@@@@#.    -@@@@@-    :%@@@@=    .#@@+     +@@@@@@@@@@@@@@@@@@=            
           =@@@@@@@@@@@@@@@@@@@:    =====.     -+===:     :====     @@@@@@@@@@@@@@@@@@@@+           
          +@@@@@@@@@@@@@@@#%%#-                                     :*%%#%@@@@@@@@@@@@@@@+          
         =@@@@@@@@@@@@@@%.       ...........................              *@@@@@@@@@@@@@@@=         
        =@@@@@@@@@@@@@@@+      .#@@@@@@@@@@@@@@@@@@@@@@@@@@#     .*:      =@@@@@@@@@@@@@@@@-        
       -@@@@@@@@@@@@@@@@@=    .%@@@@@@@@@@@@@@@@@@@@@@@@@@#     :@@@-    =@@@@@@@@@@@@@@@@@@:       
      :@@@@@@@@@@@@@@@@@%.   -@@@@%+=====================:     -@@@@%    :%@@@@@@@@@@@@@@@@@@.      
      %@@@@@@@@@@@@@=-=:    =@@@@#.                           +@@@@#.      -=--%@@@@@@@@@@@@@%      
     #@@@@@@@@@@@@@:       +@@@@*      ............. .       *@@@@*             %@@@@@@@@@@@@@+     
    =@@@@@@@@@@@@@@#.     #@@@@+     +@@@@@@@@@@@@@@@#.    .#@@@@+     +#.     +@@@@@@@@@@@@@@@:    
   .@@@@@@@@@@@@@@@@-   .%@@@@=     *@@@@@@@@@@@@@@@#     :%@@@@-     *@@%:    @@@@@@@@@@@@@@@@%    
   %@@@@@@@@@@@%%%#=   :@@@@@:    .#@@@@+-----------     -@@@@@:     #@@@@=    :#%%%@@@@@@@@@@@@*   
  =@@@@@@@@@@@=       -@@@@%.    :%@@@@-                =@@@@%.    .%@@@@=          :%@@@@@@@@@@@:  
  @@@@@@@@@@@%.      =@@@@#     -@@@@%:    .:::-:      +@@@@#     :@@@@@:    .       +@@@@@@@@@@@#  
 +@@@@@@@@@@@@@.    *@@@@*     =@@@@#.    -@@@@@:     #@@@@+     =@@@@%.    -@#     +@@@@@@@@@@@@@- 
.@@@@@@@@@@@@@#    *@%@%=     +@@@@*     =@@@@#.    .#@@@%=     +@@@@#     =@@@%.   =@@@@@@@@@@@@@% 
+@@@@@@@@*-==-                .          .           . ..       .....      .....     .=+=+@@@@@@@@@-
%@@@@@@@+                                                                                 -@@@@@@@@#
@@@@@@@-       =#%#=     -#%%#-     -#%%*.     +%%%*.    .*%%#=     :#%%#-     =%%%*.      .#@@@@@@@
@@@@@@=.::::::*@@@@@*:::-@@@@@@-:::=@@@@@%::::*@@@@@#::::%@@@@@+:---@@@@@@=---+@@@@@%------:=@@@@@@@
=@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@+
 *@@@@@@@@@@@@@@@@@@@@@@@@@@@%%##**++===----:::::------===++***##%%@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@* 
  -#@@@@@@@@@@@@@@@@%#*+=-:.                                        ..::-=+*##%@@@@@@@@@@@@@@@@@#-  
    :=*%@@@@@%#*=-:                                                             .:-=+*#%%%%##+-.    
                                                                                        
        K####      #####     ###    ###  ######.   ##########     K##    ### ###    ##W    ####W    
       #######    #######    ###    ###  ########  ##########     ###    ### ###   ###   W######    
      W###G####  ###W ####   ###    ###  ######### ##########     ###    ###  ##   ###   ###W####   
      ###   ###  ###   ###   ###    ##  ###    ###    ###         ###    ###  ### t##   ###   ###   
     G##    #   ###    ###   ##     ##  ###    ###    ###         ###    ###  ### ###   ##W         
     ###        ###    ###   ##    ###  ###    ###    ###         ##L    ##   ### ##   ###          
     ###        ###    ###  K##    ###  ###    ###    ###         ##     ##    #####   ###          
     ###       ,##     ###  ###    ###  ###   ###,    ##         G##    ###    ####    ###          
    W##        ###     ###  ###    ###  #########     ##         ##########    ####    ###          
    ###        ###     ###  ###    ###  ########     ###         ##########    ###i   K##           
    ###        ###     ###  ###    ##  #######       ###         ###    ###    ####   ###           
    ###        ###     ###  ##     ##  ###           ###         ###    ###   ##W##   ###           
    ###        ###     ##i  ##    ###  ###           ###         ###    ##    ## ##   ###           
    ###        ###    ###  ,##    ###  ###           ###         ##     ##   ### ##   ###           
    ###    ### ###    ###  K##    ###  ###           ##         t##    ###   ##  ###  ###    ###    
    ###   G##i ###   ###   .##   ###.  ##t           ##         ###    ###  ###  ###  W##,   ###    
     ########  W##W#####    ########   ##           ###         ###    ###  ##    ##   ####W###     
     #######    #######     #######   ###           ###         ###    ### ###    ##.  #######      
      #####      #####       #####    ###           ###         ###    ### ##W    ###   #####       
                   ###                                                                              
                   ###                                                                              
                   #####                                                                            
                    ####                                                                            
                      K                                                                             
*/